{"title":"C# con Devexpress!","slug":"C-y-Devexpress","html":"<!-- ![Acordeon](media/blog/Devexpress/Acordeon/banner.png) -->\n\n<blockquote>\n<p>Este artículo hace parte de una iniciativa genial: el primer calendario de\nadviento de C# español. Cada día, durante 9 días, dos artículos nuevos sobre\nC# serán compartidos por la comunidad. Esta es mi contribución.</p>\n</blockquote>\n<p>Hace un poco mas de cinco años que conoci <strong>C#</strong> y junto a el <strong>Devexpress</strong>,\nera mi primer trabajo sin experiencia alguna y frente a un mundo lleno de nuevos\nretos, había realizado pequeños proyectos de clases con visual basic pero esto\nera totalmente diferente y más aún cuando mire el poder que tenía y lo que se\npodia hacer al ver los controles que ofrecía Devexpress y su integración con C#,\ncreo que es por esto que le tengo tanto apreció a este lenguaje pues fue quien\nme dio la oportunidad de hoy poder trabajar como programador, es por eso que hoy\nles quiero contar un poco sobre este fremework y su integración con C#.</p>\n<p>Devexpress desde mi punto de vista esta enfocado en la experiencia de usuario,\nes por ello que en este artículo estaremos abordando el tema de <strong>Fluent Design\nForm and Acrylic effects</strong> una de las nuevas capacidades diseñadas para replicar\nla metáfora de la próxima generación de IU de Microsoft</p>\n<h2 id=\"winforms---forma-de-diseño-fluido-y-efectos-winforms-fluent-design-and-acrylic-effects\">WinForms - Forma de diseño fluido y efectos (WinForms Fluent Design and Acrylic Effects)</h2>\n<p>La idea de elementos de ventana parcialmente transparentes se remonta al efecto\nAero en Windows 7. En las últimas versiones de Windows 10, Microsoft está\nintroduciendo Acrylic, que se explica\n<a target=\"_blank\" rel=\"nofollow\" href=\"https://docs.microsoft.com/en-us/windows/uwp/design/style/acrylic\">en este artículo relacionado con UWP</a>.\nPara ilustrar, esta imagen muestra un formulario con un control de acordeón\nparcialmente transparente:</p>\n<p><img src=\"media/blog/Devexpress/Acordeon/winforms-fluent-form.png\" alt=\"WinForms Fluent Design and Acrylic Effects\">\nComo consecuencia de la iniciativa Fluent Design de Microsoft , muchos\ndesarrolladores de aplicaciones modernas como la de la imagen hacen tres\nelecciones importantes para sus implementaciones de UI:</p>\n<ul>\n<li>Implementan un diseño adaptable, por lo que las ventanas de la aplicación se\nven bien en diferentes tamaños de pantalla.</li>\n<li>Muestran una barra de navegación que utiliza Acrílico y el efecto Revelar\nresaltado.</li>\n<li>Utilizan un menú de hamburguesas, que desempeña un papel importante para los\nescenarios de diseño adapta.</li>\n</ul>\n<h2 id=\"diseño-fluido-para-winforms\">Diseño fluido para WinForms</h2>\n<p>Para crear aplicaciones similares para Windows Forms, primero creamos un nuevo\ncontrol de formulario llamado FluentDesignForm. Como reemplazo del estándar\nForm, esto es similar XtraForm, RibbonFormy, TabbedForm, pero también es muy\ndiferente porque combina varios elementos conectados:</p>\n<ul>\n<li>Un control de acordeón para la navegación, con un nuevo estilo de menú de\nhamburguesa aplicado.</li>\n</ul>\n<p><img src=\"media/blog/Devexpress/Acordeon/Menu.png\" alt=\"Menu Hamburguesa\"></p>\n<ul>\n<li>Fluent Design Form Control toma el control del área de encabezado del\nformulario y le permite agregar botones, editores y etiquetas en su\nsuperficie.</li>\n</ul>\n<p><img src=\"media/blog/Devexpress/Acordeon/elements.png\" alt=\"Diseño fluido\"></p>\n<ul>\n<li>El contenedor de formularios de diseño fluido contiene el contenido del\nformulario.</li>\n</ul>\n<h2 id=\"transparencia-parcial\">Transparencia parcial</h2>\n<p>Establézcalo FluentDesignForm.EnableAcrylicAccenten true para habilitar el\nefecto Acrílico para el Control de Acordeón. Al mismo tiempo, el efecto Revelar\nresaltado también se activa, imitando una fuente de luz suave que se mueve junto\ncon el puntero del mouse.</p>\n<p><img src=\"media/blog/Devexpress/Acordeon/transparencia.gif\" alt=\"Transparencia parcial\"></p>\n<blockquote>\n<p>Notas: Tenga en cuenta que ambos efectos están habilitados en Windows 10\nversión 1803 (compilación de SO 17134), que se requiere para ver estos efectos\nen acción. El formulario de diseño fluido detecta su compilación de Windows y\nutiliza automáticamente la representación de DirectX para pintar estos\nefectos, si es posible.</p>\n</blockquote>\n<h2 id=\"diseño-adaptativo\">Diseño adaptativo</h2>\n<p>Como mencioné anteriormente, el diseño adaptativo es el componente final\nimportante de Fluent Design, y nuestro nuevo Formulario implementa esto\nutilizando dos valores de umbral para su ancho. Cuando un usuario cambia el\ntamaño del formulario, el Control de acordeón cambia automáticamente su\nDisplayModedependiendo del ancho.</p>\n<p><img src=\"media/blog/Devexpress/Acordeon/resize.gif\" alt=\"Diseño adaptativo\"></p>\n<h2 id=\"integración-de-acordeón\">Integración de acordeón</h2>\n<p>El Control de Acordeón puede integrarse con la Forma de Diseño Fluido en dos\nmodos: un modo &quot;tradicional&quot; donde el encabezado del formulario es el elemento\nmás alto, y un modo de &quot;tamaño completo&quot; donde el Acordeón se extiende hasta la\nparte superior del Formulario.</p>\n<p><img src=\"media/blog/Devexpress/Acordeon/acordeon.png\" alt=\"Acordeon\"></p>\n<blockquote>\n<p>Notas: Tenga en cuenta que el modo de tamaño completo funciona mejor con las\nmáscaras planas modernas, por lo que actualmente requiere The Bezier o una de\nlas máscaras DevExpress de Office 2016.</p>\n</blockquote>\n<h2 id=\"conclusiones\">Conclusiones</h2>\n<p>C# es un lenguaje muy excepcional con muchísimas funcionalidades y desde mi\npropia experiencia Devexpress lo complementa si deseas una ofrecer una expericia\nde usuario amigable.</p>\n<p>Tambien cabe mencionar que Devexpress tiene controles que se integran\nperfectamente con Xamarin, Visual Studio (C#, ASP.NET y ASP.NET MVC), Delphi,\nHTML5 / JavaScript.</p>\n<p>Y tú, ¿Considerarías usarlos en tu próxima aplicación?</p>\n<p><img src=\"media/blog/Devexpress/Acordeon/images.jpg\" alt=\"Acordeon\"></p>\n<h2 id=\"agradecimimento\">Agradecimimento</h2>\n<p>Un Agradecimiento especial a los organizadores del primer <strong>#advientocsharp</strong> en\nespañol, por darme la oportunidad de ser parte de esta evento ya que es mi\nprimera publicación en un blog, esperando que este articulos sea de sua agrado\nme despido.</p>\n","date":"2018-12-12T07:08:02.000-07:00","feature_image":"media/blog/Devexpress/Acordeon/banner.png","excerpt":"","printDate":"December 12, 2018","printReadingTime":"4 min read"}