{"title":"Xamarin - Conectar un Dispositivo para probar Apps!","slug":"xamarin-conectar-un-dispositivo-para-probar-apps","html":"<!-- ![Post Xamarin](media\\blog\\Xamarin\\Debug\\How-to-Debug-Xamarin-Application-on-Visual-Studio-660x420.png) -->\n\n<blockquote>\n<p>Este artículo hace parte de una iniciativa genial: del primer calendario de\nXamarin en español. Cada día, dos artículos nuevos sobre C# serán compartidos\npor la comunidad. Esta es mi contribución.</p>\n</blockquote>\n<p>Conozco de vista Xamarin desde que era parte del Proyecto Mono, pero siempre me\ndio miedo trastearlo aún cuando ya se habia convertido en Xamarin, pero hasta\nhace poco he comenzado a practicarlo, practicas que van desde conectar a azure,\nfirebase, o bases de datos internas LiteDB, entre muchas cosas más por lo cual\nestoy convencido que me falta mucho por aprender.</p>\n<p>Pero en este articulo quisiera mostrarle algo que seguro todos los expertos ya\nsaben, pero que los novatos como yo batallamos mucho al iniciar en Xamarin y es\nel tratar de conectar nuestro dispositivo ya sea un celular, tablet, etc, para\nver como se miran nuestras apps en el dispositivo, aunque tengamos un emulador,\nnosotros queremos quitarnos las ganas de ver nuestra app en el dispositivo, asi\nque vamos a darle..</p>\n<h2 id=\"conectar-tu-celular-para-probar-apps\">Conectar tu Celular para probar Apps</h2>\n<p>Bueno para iniciar cuando ya tenemos nuestro proyecto cargado, en la parte\nsuperior donde se encuentran las opciones de debug popdras ver que solo\nencontran las opciones de compilación con simulador que trae integrado Visual\nStudio.</p>\n<p><img src=\"media/blog/Xamarin/Debug/dev-1.png\" alt=\"Debug Simulador\"></p>\n<h2 id=\"activar-modo-desarrollador-y-depuración-usb\">Activar Modo Desarrollador y Depuración USB</h2>\n<p>Para poder conectar nuestro dispositivo, primeros debemos ir a ajustes &gt; Acerca\ndel télefono y debes de seleccionar <strong>Versión MIUI</strong> varias veces hasta que te\nsalga que ya eres un programador.</p>\n<p><img src=\"media/blog/Xamarin/Debug/dev-2.gif\" alt=\"Activar modo desarrrollador\"></p>\n<p>Luego busca el menu de <strong>Opciones de Desarrollador</strong> que se te acaba de activar,\nen las opciones de desarrollador activa el modo de <strong>depuración USB e Instalar\nvía USB</strong>, en mi caso lo encontre en Ajuste adicionales, cabe mencionar que\nestoy usando un Redmi Note 8 Pro.</p>\n<p><img src=\"media/blog/Xamarin/Debug/dev-3.png\" alt=\"Activar depuración USB\"></p>\n<blockquote>\n<p>Nota: al Activar la depuración, te aparecera un mensaje emergente\npreguntandote si te gustaria activar la depuración USB, dale aceptar.</p>\n</blockquote>\n<p>Una vez realizado todo los pasos anteriores, ve a tu proyecto de Xamarin y\nrevisa la opciones de debug, y veras seleccionado tu dispositivo listo para\nhacer tus pruebas.</p>\n<h2 id=\"compilar-e-instalar-nuestra-apps-en-el-dispositivo\">Compilar e Instalar nuestra Apps en el dispositivo</h2>\n<p><img src=\"media/blog/Xamarin/Debug/dev-4.png\" alt=\"Debugactivado\"></p>\n<p>Una vez que corras tu proyecto en tu dispositivo se mostrara un mensaje\nemergente indicando si quieres instalar una nueva app con el nombre de tu\nproyecto.</p>\n<p><img src=\"media/blog/Xamarin/Debug/dev-5.jpg\" alt=\"Activar depuración USB\"></p>\n<p>Seguido en tu dispositivo aparece el logo de Xamarin indicando que tu app se ha\ninstalado.</p>\n<p><img src=\"media/blog/Xamarin/Debug/dev-6.png\" alt=\"Activar depuración USB\"></p>\n<h2 id=\"conclusiones\">Conclusiones</h2>\n<p>Como puede ver, no es demasiado complicado pero que si resulta un dolor de\ncabeza cuando estas iniciando, espero les ayude y compartan para que más\npersonas conozcan el mundo de Xamarin.</p>\n<p>Buenos eso ha sido todo ppara este post, nos vemos en el siguiente.</p>\n<p><img src=\"media/blog/Xamarin/Debug/xamarin-visualStudio.png\" alt=\"Xamarin\"></p>\n<h2 id=\"agradecimimento\">Agradecimimento</h2>\n<p>Un Agradecimiento especial a los organizadores del primer <strong>#AdvientoXamarin</strong>\nen español en especial a <strong>@Luis Beltran</strong> por alentarnos a publicar lo poco que\nsabemos y por darme la oportunidad de ser parte de esta evento esperando un día\nconocerlo en persona y estrechar su mano.</p>\n<p>Esperando que este articulos sea de sua agrado me despido.</p>\n","date":"2019-12-18T07:08:02.000-07:00","feature_image":"media/blog/Xamarin/Debug/How-to-Debug-Xamarin-Application-on-Visual-Studio-660x420.png","excerpt":"","printDate":"December 18, 2019","printReadingTime":"3 min read"}